[{"_index": "hotlinefaq", "_id": "71", "_score": 2.696588, "_ignored": ["Support.keyword"], "_source": {"Ticket": 63047434, "Process": "XT018", "Customer": "Oqmented", "Subject": " possibility to transfer analog IP between XT018 and XT018", "Description": "request for design transfer guideline", "Topic": "Analog cell library", "Support": "Yes there is some compatibility between the XH018 and XT018 processes.\nThe fastest transfer: the analog library created in one process setup, and open it under the other process setup.\n\nCheck that the primitive devices used also exist in the other process. If certain devices do not exist, they have to be deleted from the circuit and replaced with the and replace them with the corresponding counterpart from the other process.\nA new circuit verification (simulation) and layout verification (DRC, LVS) is recommended.\nis recommended.\n"}}, {"_index": "hotlinefaq", "_id": "102", "_score": 2.3148541, "_source": {"Ticket": 63013635, "Process": "XT018", "Customer": "Melexis Bulgaria", "Subject": "Off-Grid discrepancies detected in XT018", "Description": "Request to replicate off-grid error detected. Melexis would like to have an access to rule deck\nused by X-Fab to validate off-grid errors", "Topic": "Backend", "Support": "This rule is developed by MaskTooling team. The team is working on standardisation and harmonisation of the off-grid check and no timeline is specify until when this objective will be achieved."}}, {"_index": "hotlinefaq", "_id": "1", "_score": 1.7671082, "_source": {"Ticket": 63045340, "Process": "XT018", "Customer": "AIM Infrarot Module", "Subject": "noise comparison for baseline mos devices between xc018 and xt018 to faciliate possibility of design migration", "Description": "request for additional characterization", "Topic": "Noise", "Support": null}}, {"_index": "hotlinefaq", "_id": "18", "_score": 1.7671082, "_ignored": ["Support.keyword"], "_source": {"Ticket": 63045122, "Process": "XT018", "Customer": "Nexperia", "Subject": "design challenge for 90V push pull stage driver with 14V supply and very steep transient", "Description": "request for new feature", "Topic": "PR Process Reliability spec", "Support": "We intend to use the NBUR to isolate the high side from the current spikes caused by the handle wafer. This will mean to waive several DRC errors. In the long run I will try to convince the team for the next xt018 release (r11) to allow certain elements on NBUR to make full reign of the capabilities of xt018 - (Usage of NBUR in xt018. For mos half bridge driver which control voltage can be up to 20 V it would be beneficial to have some HV devices isolated by NBUR. We identified candidates and will allow some more devices with r11.)"}}, {"_index": "hotlinefaq", "_id": "19", "_score": 1.7671082, "_ignored": ["Support.keyword"], "_source": {"Ticket": 63045718, "Process": "XT018", "Customer": "NTLab", "Subject": "support of Inductor device", "Description": "request for new device", "Topic": "PCELL, Primitive devices", "Support": "we don't have any inductors in XT018. I suppose you could\ndevelop your own, but we would not be able to support you (pdk, drc, lvs,\nextract, model, characterisation, reliability tests etc).\n\nWe do have inductors in some other technologies (XH035, XR013 etc), but these\nare quite different platforms, so a translation of design would not be\ntrivial. "}}, {"_index": "hotlinefaq", "_id": "27", "_score": 1.7671082, "_ignored": ["Support.keyword"], "_source": {"Ticket": 63046403, "Process": "XT018", "Customer": "Avicena", "Subject": "intend to create pwell-hvnwell photodiode for high response at 430nm and low capacitance ", "Description": "request for new device", "Topic": "Opto / optical sensors", "Support": "propose to use the p-Zehner implant (PZN) as anode and to implement the cathode either with a NBD or DFN well. I am no expert on XT018 layout, so I cannot recommend how to draw this. For very low reverse bias, the NBD will offer likely the lower capacitance, whereas for normal to higher reverse bias, the DFN would offer the lower junction capacity.\n \nDFN requires the NHVR or PHVR module (HVMOS N-drift implant gds 292)\nNBD requires the HVN module (HVNWELL gds 87)\nPZN requires the DIODEB module (PZEHNER gds 209)\n\nPWell is no good choice as the doping profile will prevent a good blue response."}}, {"_index": "hotlinefaq", "_id": "34", "_score": 1.7671082, "_ignored": ["Support.keyword"], "_source": {"Ticket": 63046388, "Process": "XT018", "Customer": "Institute of Microelectronics Chinese academy of Science", "Subject": "looking for doping concentration of handle wafer", "Description": "request for additional data", "Topic": "PDS Process & Device Spec", "Support": "We do not specify the doping density of the XT018 handle wafer, but we do specify the resistivity - please see SpecXplorer, or the Process and Device Specification document and search for parameter RSWAFHW. You may be able to conclude something about the doping concentration from that resistivity value"}}, {"_index": "hotlinefaq", "_id": "37", "_score": 1.7671082, "_source": {"Ticket": 63046636, "Process": "XT018", "Customer": "NT lab", "Subject": "looking for EM mdel (electromagnetic model)", "Description": "request for new feature", "Topic": "models", "Support": null}}, {"_index": "hotlinefaq", "_id": "38", "_score": 1.7671082, "_source": {"Ticket": 63046193, "Process": "XT018", "Customer": "NT Lab", "Subject": "Looking for guideline for pad opening/bump layout, assuming 3rd party vendor will connect pads to balls via RDL", "Description": "request for addition guideline", "Topic": "backend", "Support": "I can only suggest you to please liaise with your assembly house to find out their requirements for RDL / bumping. So long as their requirements do not clash with ours, then you should be able to follow their rules"}}, {"_index": "hotlinefaq", "_id": "43", "_score": 1.7671082, "_source": {"Ticket": 63046557, "Process": "XT018", "Customer": "Analog Power Conversion", "Subject": "sandwich capacitors using metaltop/metal4/metal3/metal2/metal1 as well as creating metaltop/metal1 capacitors.  I want to use POLY1 as a grounded noise shield for both", "Description": "request for new device", "Topic": "PCELL, Primitive devices", "Support": "can consider cif5"}}]